dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
/*
 MiniMe Bot Commands
 Public Commands:
• !apod — NASA Astronomy Picture of the Day.
• !ask <question> — Asks DeepSeek (text AI reply in chat).
• !display <text> — Writes custom text to the OLED screen.
• !help — Shows this command list.
• !iss — Current International Space Station position.
• !news — Space and high-tech science headlines.
• !physics — Latest arXiv physics papers.
• !sysinfo — Displays system diagnostics (uptime, heap, RSSI, etc.).
• !temp — Reads the current indoor temperature sensor.
• !time — Displays the current bot time.
• !weather <zip> — Fetches the weather report for a US ZIP code.
 Owner-Only Commands:
• !led on / !led off — Controls the RGB NeoPixel LED.
• !servo <0-90> — Moves the servo motor to a specific angle.
• !set1 on / !set1 off — Controls digital output pin 1.
• !set2 on / !set2 off — Controls digital output pin 2.

 Sketch map (this file, top to bottom):
 1) Config, pins, NTP / Pacific DST
 2) Discord Gateway state + 8-user presence / 24h command counts
 3) SSD1327 dashboard, sleep, overlays (U8g2 drawStr; y is font baseline)
 4) GPIO, servo, DS18B20, NeoPixel
 5) Discord REST, public HTTP APIs, command handler
 6) Touch wake pad (GPIO 4) + USB VBUS ADC (GPIO 1 divider)
 7) Gateway websocket, bot Online/Idle presence, scheduled posts, setup / loop
 Display sleep dims then blanks the OLED only. ESP32 and Wi-Fi stay running.
 Touch on GPIO 4 wakes the panel with the same on/dim/off timing.
 Bot Discord status: online on activity; idle after 5 minutes quiet. Touch does not set Online.
*/
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <Wire.h>
#include <U8g2lib.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Adafruit_NeoPixel.h>
#include <driver/ledc.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <time.h>
#include <esp_heap_caps.h>
#include <esp_idf_version.h>
// ====== USER CONFIG ======
// Local-only secrets. GitHub sketch keeps placeholders. Do not commit real values.
const char* WIFI_SSID     = "ssid";
const char* WIFI_PASSWORD = "password";
const char* BOT_TOKEN     = "bot token";
const char* WEATHER_API_KEY = "WEATHER_API_KEY";
const char* NASA_API_KEY    = "NASA_API_KEY";
const char* DEEPSEEK_API_KEY = "DEEPSEEK_API_KEY";
// Guild to fetch members from at startup
#define BOT_GUILD_ID "GUILD_ID"
// ====== OWNER AND CHANNEL IDS ======
// OWNER_ID_STR: who may run GPIO / servo.
// TARGET_CHANNEL_ID: commands + auto sysinfo / 6-12-18 temp posts.
// TARGET_CHANNEL_ID1: second channel that may run commands.
const String OWNER_ID_STR        = "OWNER_ID_STR";
const char*  TEMP_CHANNEL_ID_STR = "TEMP_CHANNEL_ID_STR";  // main channel
const String TARGET_CHANNEL_ID  = "TARGET_CHANNEL_ID";
const String TARGET_CHANNEL_ID1 = "TARGET_CHANNEL_ID1";
// ====== GPIO CONFIG ======
// WeAct ESP32-S3-N16R8 defaults. Change here if wiring differs.
const int RGB_LED_PIN = 48;
const int PIN_SERVO   = 47;
const int PIN_SET1    = 6;
const int PIN_SET2    = 7;
const int PIN_DS18B20 = 10;
// I2C SSD1327 128x128 (GND / VCC / SCL / SDA on the module)
const int PIN_I2C_SDA = 8;
const int PIN_I2C_SCL = 9;
const int PIN_TOUCH   = 4; // TOUCH4 — wire pad here
const uint32_t TOUCH_THRESHOLD = 2000; // constant gap: trip = rolling idle avg + this
const unsigned long TOUCH_DEBUG_MS = 500;
// USB 5V (VBUS) → 10k → PIN_USB_VBUS_ADC → 10k → GND. Do not feed 5V straight into the pin.
const int PIN_USB_VBUS_ADC = 1;
const uint32_t USB_VBUS_R_HI = 10000; // ohms, 5V side
const uint32_t USB_VBUS_R_LO = 10000; // ohms, GND side
const uint8_t TOUCH_AVG_N = 16;       // rolling idle window
const unsigned long USB_VBUS_READ_MS = 50;
// ====== TIME CONFIG (NTP) — US Pacific, with daylight saving ======
// NTP is fetched as UTC, then offset to PST or PDT for the dashboard clock and scheduled posts.
WiFiUDP ntpUDP;
const long PST_OFFSET_SEC = -28800; // UTC-8 standard
const long PDT_OFFSET_SEC = -25200; // UTC-7 daylight
NTPClient timeClient(ntpUDP, "pool.ntp.org", 0, 60000);

// US Pacific DST helpers (NTP is UTC; offset applied in updateLocalTime).
int civilDayOfWeek(int year, int month, int day) { // 0 = Sunday
  static const int t[] = {0, 3, 2, 5, 0, 3, 5, 1, 4, 6, 2, 4};
  int y = year;
  if (month < 3) y--;
  return (y + y / 4 - y / 100 + y / 400 + t[month - 1] + day) % 7;
}

int nthSundayOfMonth(int year, int month, int nth) {
  int dow1 = civilDayOfWeek(year, month, 1);
  int firstSunday = 1 + ((7 - dow1) % 7);
  return firstSunday + (nth - 1) * 7;
}

bool isPacificDaylightTime(unsigned long utcEpoch) {
  time_t t = (time_t)utcEpoch;
  struct tm tmUtc;
  gmtime_r(&t, &tmUtc);
  int year = tmUtc.tm_year + 1900;
  int month = tmUtc.tm_mon + 1;
  int day = tmUtc.tm_mday;
  int hour = tmUtc.tm_hour;
  if (month < 3 || month > 11) return false;
  if (month > 3 && month < 11) return true;
  if (month == 3) {
    int startDay = nthSundayOfMonth(year, 3, 2); // 2nd Sunday, 2:00am PST = 10:00 UTC
    if (day < startDay) return false;
    if (day > startDay) return true;
    return hour >= 10;
  }
  int endDay = nthSundayOfMonth(year, 11, 1); // 1st Sunday, 2:00am PDT = 09:00 UTC
  if (day < endDay) return true;
  if (day > endDay) return false;
  return hour < 9;
}

void updateLocalTime() {
  timeClient.setTimeOffset(0);
  timeClient.update();
  unsigned long utc = timeClient.getEpochTime();
  timeClient.setTimeOffset(isPacificDaylightTime(utc) ? PDT_OFFSET_SEC : PST_OFFSET_SEC);
}
// ====== SCHEDULED & INTERVAL TASKS ======
// 4-hour sysinfo and 06:00 / 12:00 / 18:00 Pacific indoor-temp posts go to TARGET_CHANNEL_ID.
const unsigned long SYSINFO_INTERVAL_MS = 14400000UL; // 4 Hours
unsigned long lastSysInfoMillis = 0;
int lastSentHour = -1;
// ====== DISCORD GATEWAY ======
// Websocket to gateway.discord.gg. gwDoc lives in PSRAM (256KB). Do not put small TLS buffers in PSRAM.
WebSocketsClient gatewayWS;
WiFiClientSecure httpsClient;
DynamicJsonDocument* gwDoc = nullptr;
const size_t GW_DOC_PSRAM = 262144;   // 256KB
const uint32_t BOARD_PSRAM_BYTES = 8UL * 1024UL * 1024UL; // this ESP32-S3 board
bool gatewayConnected     = false;
bool identified           = false;
int  heartbeatIntervalMs   = 0;
unsigned long lastHeartbeatMillis = 0;
int lastSeq               = 0;
// Bot's own Discord status (Gateway OP 3). Not the 8-user OLED rows.
unsigned long lastBotActivityMillis = 0;
const unsigned long BOT_PRESENCE_IDLE_MS = 300000UL; // 5 minutes quiet -> Idle
uint8_t botDiscordStatus = 2; // 1=idle, 2=online
bool botDiscordStatusSent = false;
const uint32_t CPU_MHZ_ACTIVE = 240;
const uint32_t CPU_MHZ_OLED_OFF_BOT_IDLE = 80;
void noteBotActivity();
void updateBotPresenceIdle();
void sendBotPresence(const char* status, bool afk);
// ====== DISPLAY STATE ======
// Full-buffer U8g2 on SSD1327. No setCursor: drawStr(x, y) uses y as the font baseline.
// Waveshare-style 1.5" 128x128 SSD1327. EA_W128128 shifts the picture down so
// firmware y=0 is not the top of the glass, and y=119/127 (lines 15-16) fall off the bottom.
U8G2_SSD1327_WS_128X128_F_HW_I2C u8g2(U8G2_R0, /* reset=*/ U8X8_PIN_NONE);
void noteDisplayActivity();
void drawDashboard();

// Dashboard live data
float dashTempC = -999.0f;
float dashTempF = -999.0f;
int lastServoDeg = 45;
String dashLastCmd   = "none";
String dashLastEvent = "Starting...";
unsigned long dashLastCmdMillis = 0;

// ====== USER TRACKING (8 dashboard rows) ======
// Eight OLED rows: name, On/Idle/DND/Off, Bot:N (commands in the last 24h).
// Slots fill from a startup REST member list; presence comes from the Gateway.
struct TrackedUser {
  String userId;
  String userName;
  uint8_t status;   // 0=Off, 1=Idle, 2=On
  uint32_t useCount24h;
  bool active;
};

static const uint8_t MAX_TRACKED_USERS = 8;
TrackedUser trackedUsers[MAX_TRACKED_USERS];
String cachedGuildIds[3];
uint8_t cachedGuildCount = 0;

unsigned long usesWindowStartMillis = 0;
const unsigned long USES_WINDOW_MS = 86400UL * 1000UL; // 24 hours

// Discord presence string -> dashboard status byte (0 Off, 1 Idle, 2 On, 3 DND).
uint8_t statusFromDiscord(const char* status) {
  if (!status) return 0;
  if (strcmp(status, "online") == 0) return 2;
  if (strcmp(status, "idle") == 0) return 1;
  if (strcmp(status, "dnd") == 0) return 3;
  if (strcmp(status, "offline") == 0) return 0;
  return 0;
}

