dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
// ====== FORWARD DECLARATIONS ======
bool readTemperature(float &tempC, float &tempF);
bool readHttpBodyAfterHeaders(Client& client, bool chunked, int contentLength,
                              String& outBody, unsigned long deadlineMs);
bool discordIdLooksValid(const String& id);

// ====== DISPLAY UTILS ======
// Wake/sleep, overlays, dashboard paint. U8g2 y is baseline (not Adafruit setCursor).

// Wake the panel if it was in power-save, and restart the 1-minute idle timer.
void noteDisplayActivity() {
  lastDisplayActivityMillis = millis();
  if (displayAsleep) {
    displayAsleep = false;
    u8g2.setPowerSave(0);
    lastDashMillis = 0;
  }
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
}

// ISR: touchAttachInterrupt sets flag; pollTouchWake() debounces and calls noteDisplayActivity().
void IRAM_ATTR onTouchWake() {
  touchWakePending = true;
}

uint32_t readTouchRaw(uint8_t pin) {
  return (uint32_t)touchRead(pin);
}

bool touchSampleValid(uint32_t raw) {
  return raw > 0 && raw < 150000;
}

uint32_t touchTripPoint() {
  return touchIdleAvg + TOUCH_THRESHOLD;
}

uint32_t readUsbVbusMilliVolts() {
  unsigned long now = millis();
  if (usbVbusLastReadMs != 0 && (now - usbVbusLastReadMs) < USB_VBUS_READ_MS) {
    return usbVbusMvCached;
  }
  usbVbusLastReadMs = now;
  uint32_t pinMv = analogReadMilliVolts((uint8_t)PIN_USB_VBUS_ADC);
  usbVbusMvCached = (uint32_t)((uint64_t)pinMv * (USB_VBUS_R_HI + USB_VBUS_R_LO) / USB_VBUS_R_LO);
  return usbVbusMvCached;
}

// Scale touch raw to boot-time USB voltage so VBUS sag/swell does not walk the gap.
uint32_t compensateTouchRaw(uint32_t raw) {
  uint32_t v = readUsbVbusMilliVolts();
  if (usbVbusRefMv < 1000 || v < 1000) return raw;
  return (uint32_t)((uint64_t)raw * usbVbusRefMv / v);
}

void setupUsbVbusAdc() {
  analogSetPinAttenuation(PIN_USB_VBUS_ADC, ADC_11db);
  pinMode(PIN_USB_VBUS_ADC, INPUT);
  uint32_t acc = 0;
  for (int i = 0; i < 8; i++) {
    usbVbusLastReadMs = 0;
    acc += readUsbVbusMilliVolts();
    delay(10);
  }
  usbVbusRefMv = acc / 8;
}

void touchIdlePush(uint32_t sample) {
  if (touchIdleBufCount < TOUCH_AVG_N) {
    touchIdleBuf[touchIdleBufCount++] = sample;
    touchIdleSum += sample;
  } else {
    touchIdleSum -= touchIdleBuf[touchIdleBufIdx];
    touchIdleBuf[touchIdleBufIdx] = sample;
    touchIdleSum += sample;
    touchIdleBufIdx = (uint8_t)((touchIdleBufIdx + 1) % TOUCH_AVG_N);
  }
  if (touchIdleBufCount > 0) touchIdleAvg = touchIdleSum / touchIdleBufCount;
}

void calibrateTouchIdleAvg() {
  touchIdleBufCount = 0;
  touchIdleBufIdx = 0;
  touchIdleSum = 0;
  touchIdleAvg = 0;
  for (int i = 0; i < TOUCH_AVG_N; i++) {
    uint32_t raw = readTouchRaw(PIN_TOUCH);
    if (touchSampleValid(raw)) touchIdlePush(compensateTouchRaw(raw));
    delay(25);
  }
  if (touchIdleBufCount == 0) {
    uint32_t raw = readTouchRaw(PIN_TOUCH);
    touchIdlePush(compensateTouchRaw(raw));
  }
  touchRawMax = touchIdleAvg;
}

// Rolling idle average while not touched. Trip stays avg + TOUCH_THRESHOLD.
void updateTouchIdleAvg(uint32_t compensated) {
  if (!touchSampleValid(compensated)) return;
  if (compensated >= touchTripPoint()) return;
  touchIdlePush(compensated);
}

void configureTouchHardware() {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
  touchSetTiming(0.5f, 100); // Arduino ESP32 3.x / IDF 5.5+
#else
  touchSetCycles(1, 100);
#endif
}

// Call once in setup() after WiFi/I2C — do not recalibrate earlier.
void setupTouch() {
  // Serial.println("--- touch init ---");
  setupUsbVbusAdc();
  configureTouchHardware();
  calibrateTouchIdleAvg();
  touchDetachInterrupt(PIN_TOUCH);
  touchAttachInterrupt(PIN_TOUCH, onTouchWake, 0);
  // Serial.print("touch GPIO");
  // Serial.print(PIN_TOUCH);
  // Serial.print(" idleAvg=");
  // Serial.print(touchIdleAvg);
  // Serial.print(" trip=");
  // Serial.print(touchTripPoint());
  // Serial.print(" usbMv=");
  // Serial.println(usbVbusRefMv);
  // printUsbVbusSerial();
}

void printUsbVbusSerial() {
  uint32_t mv = readUsbVbusMilliVolts();
  (void)mv;
  // Serial.print("usb power: ");
  // Serial.print(mv);
  // Serial.print(" mV  ");
  // Serial.print(mv / 1000);
  // Serial.print(".");
  // uint32_t hun = (mv % 1000) / 10;
  // if (hun < 10) Serial.print("0");
  // Serial.print(hun);
  // Serial.println(" V");
}

void debugTouchSerial() {
  unsigned long now = millis();
  if (now - lastTouchDebugMillis < TOUCH_DEBUG_MS) return;
  lastTouchDebugMillis = now;

  uint32_t raw = readTouchRaw(PIN_TOUCH);
  uint32_t compensated = compensateTouchRaw(raw);
  uint32_t trip = touchTripPoint();
  bool touched = compensated >= trip;

  if (!touched) updateTouchIdleAvg(compensated);
  if (raw > touchRawMax) touchRawMax = raw;

  // Serial.print("touch GPIO");
  // Serial.print(PIN_TOUCH);
  // Serial.print(": raw=");
  // Serial.print(raw);
  // Serial.print(" comp=");
  // Serial.print(compensated);
  // Serial.print(" idleAvg=");
  // Serial.print(touchIdleAvg);
  // Serial.print(" trip=");
  // Serial.print(trip);
  // Serial.print(" usbMv=");
  // Serial.print(readUsbVbusMilliVolts());
  // Serial.print(" touched=");
  // Serial.println(touched ? "YES" : "no");
  // printUsbVbusSerial();
}

bool touchIsActive() {
  uint32_t raw = readTouchRaw(PIN_TOUCH);
  uint32_t compensated = compensateTouchRaw(raw);
  if (compensated >= touchTripPoint()) return true;
#if SOC_TOUCH_SENSOR_VERSION == 2
  if (touchInterruptGetLastStatus(PIN_TOUCH)) return true;
#endif
  updateTouchIdleAvg(compensated);
  return false;
}

// Polling fallback + interrupt flag; debounced wake into noteDisplayActivity().
void pollTouchWake() {
  unsigned long now = millis();
  if (now - lastTouchWakeMillis < TOUCH_DEBOUNCE_MS) return;
  if (!touchWakePending && !touchIsActive()) return;
  touchWakePending = false;
  lastTouchWakeMillis = now;
  noteDisplayActivity();
}

// After 1 minute idle, dim over 15 s, then blank the OLED. Clock/RSSI/heap ticks do not count.
void updateDisplaySleep() {
  if (displayAsleep) return;
  unsigned long now = millis();
  if (lastDisplayActivityMillis == 0) {
    lastDisplayActivityMillis = now;
    return;
  }

  unsigned long idle = now - lastDisplayActivityMillis;
  if (idle < DISPLAY_IDLE_MS) return;

  if (idle < DISPLAY_IDLE_MS + DISPLAY_DIM_MS) {
    unsigned long dimElapsed = idle - DISPLAY_IDLE_MS;
    uint8_t contrast = (uint8_t)(DISPLAY_CONTRAST_FULL -
      (dimElapsed * (unsigned long)DISPLAY_CONTRAST_FULL) / DISPLAY_DIM_MS);
    u8g2.setContrast(contrast);
    return;
  }

  displayAsleep = true;
  u8g2.setPowerSave(1); // panel off until touch or a real event
}

