dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
// Queue a 2-line status (OLED rows 15-16). Dashboard is not replaced.
void showTransient(const String& line1, const String& line2 = "", const String& line3 = "", unsigned long durationMs = 3000) {
  noteDisplayActivity();
  transientLine1 = line1;
  transientLine2 = line2;
  transientLine3 = line3;
  transientUntilMs = millis() + durationMs;
  lastDashMillis = 0; // loop/updateDisplay paints; do not draw here (stack + NTP inside Gateway)
}

// Draw the persistent dashboard (128x128 SSD1327)
// U8g2 drawStr(x, y): y is the FONT BASELINE, not the top of the glyph and not setCursor.
// 5x7 font is 7px tall, so header at y=7 sits on the top of the panel (pixels ~0-6).
// Font: u8g2_font_5x7_tf = 5px wide + 1px gap = 6px/char, 7px tall + 1px gap = 8px/row
// Grid: 16 rows x 18 chars on 128x128
// Row baselines (y = row*8, glyph baseline at y+7):
//   Row 0  y=7   Header: MiniMe + GW:good/bad + right-justified time
//   Row 2  y=15  Bot:Online/Idle (left, 10) + Www Mmm dd YYYY (right, 15; fixed slot)
//   Row 3  y=23  Sig bar
//   Row 4  y=31  Heap bar
//   Row 5  y=39  Srv bar (0-90 deg)
//   Row 6  y=47  Up:xxxxdxxhxxm T:xxxF/xxxC  (or T:--Error--; space-padded)
//   Row 7  y=55  User1
//   Row 8  y=63  User2
//   Row 9  y=71  User3
//   Row 10 y=79  User4
//   Row 11 y=87  User5
//   Row 12 y=95  User6
//   Row 13 y=103 User7
//   Row 14 y=111 User8
//   Row 15 y=119 command / !display text (blank when idle)
//   Row 16 y=127 command / !display text (blank when idle)
void drawDashboard() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_5x7_tf);

  // ---- Row 0: Header (MiniMe + GW + right-justified time) ----
  updateLocalTime();
  String t = timeClient.getFormattedTime(); // HH:MM:SS
  String gwHeader = gatewayConnected ? "GW:Good" : "GW:Bad";
  u8g2.drawStr(0, 7, "MiniMe");
  u8g2.drawStr(42, 7, gwHeader.c_str());
  // True right-justify using actual rendered width.
  int timeX = 128 - u8g2.getStrWidth(t.c_str());
  if (timeX < 0) timeX = 0;
  u8g2.drawStr(timeX, 7, t.c_str());

  // ---- Row 2: Bot Online/Idle left; DOW Mon day year right (fixed widths, no shifting) ----
  // 25 chars total: "Bot:Online" (10) + "Thu Aug 20 2026" (15). Day space-padded (%2d).
  {
    static const char* const DOW_NAME[] = {"Sun","Mon","Tue","Wed","Thu","Fri","Sat"};
    static const char* const MON_NAME[] = {"Jan","Feb","Mar","Apr","May","Jun",
                                           "Jul","Aug","Sep","Oct","Nov","Dec"};
    time_t localEpoch = (time_t)timeClient.getEpochTime();
    struct tm tmLocal;
    gmtime_r(&localEpoch, &tmLocal);
    char botBuf[12];
    snprintf(botBuf, sizeof(botBuf), "Bot:%-6s",
             (botDiscordStatus == 2) ? "Online" : "Idle");
    u8g2.drawStr(0, 15, botBuf);

    char dateBuf[20];
    snprintf(dateBuf, sizeof(dateBuf), "%s %s %2d %04d",
             DOW_NAME[tmLocal.tm_wday], MON_NAME[tmLocal.tm_mon],
             tmLocal.tm_mday, tmLocal.tm_year + 1900);
    // Right-justify against a constant slot width so DOW never moves.
    const char* dateSlot = "Www Mmm 99 9999";
    int dateX = 128 - u8g2.getStrWidth(dateSlot);
    if (dateX < 0) dateX = 0;
    u8g2.drawStr(dateX, 15, dateBuf);
  }

  // ---- Rows 3-4: Signal + Heap bars ----
  long rssi = WiFi.RSSI();
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();

  // Signal bar (row 3)
  int sigBarW = 0;
  if (rssi >= -40) sigBarW = 79;
  else if (rssi <= -100) sigBarW = 0;
  else sigBarW = (int)((rssi + 100) * 79 / 60);
  u8g2.drawStr(0, 23, "Sig:");
  u8g2.drawFrame(25, 16, 103, 8);
  if (sigBarW > 0) u8g2.drawBox(26, 17, sigBarW, 6);

  // Heap bar (row 4) — internal SRAM + this board's 8MB PSRAM, original 8px height
  uint32_t psramSize = ESP.getPsramSize();
  uint32_t psramFree = ESP.getFreePsram();
  if (psramSize < BOARD_PSRAM_BYTES) psramSize = BOARD_PSRAM_BYTES;
  if (psramFree < 1) psramFree = BOARD_PSRAM_BYTES;
  uint32_t memTotal = totalHeap + psramSize;
  uint32_t memFree  = freeHeap + psramFree;
  int heapBarW = 0;
  if (memTotal > 0) {
    heapBarW = (int)((memFree * 79UL) / memTotal);
    if (heapBarW < 0) heapBarW = 0;
    if (heapBarW > 79) heapBarW = 79;
  }
  u8g2.drawStr(0, 31, "Heap:");
  u8g2.drawFrame(25, 24, 103, 8);
  if (heapBarW > 0) u8g2.drawBox(26, 25, heapBarW, 6);

  // Servo bar (row 5) — last !servo angle 0-90, fill matches inner frame (101px)
  const int srvInnerW = 101;
  int srvBarW = (lastServoDeg * srvInnerW) / 90;
  if (srvBarW < 0) srvBarW = 0;
  if (srvBarW > srvInnerW) srvBarW = srvInnerW;
  u8g2.drawStr(0, 39, "Srv:");
  u8g2.drawFrame(25, 32, 103, 8);
  if (srvBarW > 0) u8g2.drawBox(26, 33, srvBarW, 6);

  // ---- Row 6: Up + Temp — Up:xxxxdxxhxxm T:xxxF/xxxC (space-pad, no leading zeros) ----
  unsigned long uptimeSec = millis() / 1000;
  unsigned long d = uptimeSec / 86400;
  unsigned long h = (uptimeSec % 86400) / 3600;
  unsigned long m = (uptimeSec % 3600) / 60;
  if (d > 9999) d = 9999;
  char upTempBuf[32];
  if (dashTempC > -998.0f) {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:%3.0fF/%3.0fC",
             d, h, m, dashTempF, dashTempC);
  } else {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:--Error--", d, h, m);
  }
  u8g2.drawStr(0, 47, upTempBuf);

  // ---- Rows 7-14: eight user stats (5x7 + 1px pad = 8px rows) ----
  // Name left, status after the longest name, Bot:N right-justified. Empty slots show ---.
  u8g2.setFont(u8g2_font_5x7_tf);
  const int gapPx = 4;
  const int statusW = u8g2.getStrWidth("Idle");
  const int botReserveW = u8g2.getStrWidth("Bot:999");
  int nameMaxPx = 128 - gapPx - statusW - gapPx - botReserveW;
  if (nameMaxPx < 16) nameMaxPx = 16;

  String names[MAX_TRACKED_USERS];
  int longestNamePx = 0;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (!trackedUsers[i].active) {
      names[i] = "---";
    } else if (trackedUsers[i].userName.length()) {
      names[i] = trackedUsers[i].userName;
    } else {
      names[i] = trackedUsers[i].userId;
    }
    int w = u8g2.getStrWidth(names[i].c_str());
    if (w > longestNamePx) longestNamePx = w;
  }
  if (longestNamePx > nameMaxPx) longestNamePx = nameMaxPx;
  int statusX = longestNamePx + gapPx;

