dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
  for (uint8_t row = 0; row < MAX_TRACKED_USERS; row++) {
    uint8_t y = 55 + (row * 8); // baseline: 55, 63, 71, 79, 87, 95, 103, 111
    String name = names[row];
    while (name.length() > 1 && u8g2.getStrWidth(name.c_str()) > longestNamePx) {
      name.remove(name.length() - 1);
    }
    u8g2.drawStr(0, y, name.c_str());

    String statusWord = String(statusToWord(trackedUsers[row].active ? trackedUsers[row].status : 0));
    u8g2.drawStr(statusX, y, statusWord.c_str());

    uint32_t uses = trackedUsers[row].active ? trackedUsers[row].useCount24h : 0;
    String botStr = "Bot:" + String(uses);
    int botX = 128 - u8g2.getStrWidth(botStr.c_str());
    if (botX < statusX + statusW + 2) botX = statusX + statusW + 2;
    u8g2.drawStr(botX, y, botStr.c_str());
  }

  u8g2.setFont(u8g2_font_5x7_tf);
  String row15 = "";
  String row16 = "";
  if (millis() < transientUntilMs) {
    row15 = transientLine1;
    row16 = transientLine2;
    if (transientLine3.length()) {
      if (row16.length()) row16 += " ";
      row16 += transientLine3;
    }
  }
  u8g2.drawStr(0, 119, row15.c_str());
  u8g2.drawStr(0, 127, row16.c_str());

  u8g2.sendBuffer();
}

// Draw status on rows 15-16 without wiping the dashboard.
void drawTransient() {
  lastDashMillis = 0;
}

// Called from loop: sleep check, then 2s dashboard refresh (rows 15-16 show events while active).
void updateDisplay() {
  updateDisplaySleep();
  if (displayAsleep) return;
  unsigned long now = millis();
  if (transientUntilMs != 0 && now >= transientUntilMs) {
    transientUntilMs = 0;
    lastDashMillis = 0;
  }
  if (lastDashMillis == 0 || now - lastDashMillis >= DASH_REFRESH_MS) {
    lastDashMillis = now;
    // Refresh temp reading for dashboard
    float c, f;
    if (readTemperature(c, f)) {
      dashTempC = c;
      dashTempF = f;
    }
    drawDashboard();
  }
}

// Legacy helper kept for boot/connect messages that need an immediate paint
void drawStatus(const String& line1, const String& line2 = "", const String& line3 = "") {
  showTransient(line1, line2, line3, 3000);
}

// ====== SERVO (LEDC 50Hz PWM, owner !servo 0-90) ======
void setupServo() {
  ledc_timer_config_t timer = {
    .speed_mode       = LEDC_LOW_SPEED_MODE,
    .duty_resolution  = LEDC_TIMER_14_BIT,
    .timer_num        = LEDC_TIMER_0,
    .freq_hz          = 50,
    .clk_cfg          = LEDC_AUTO_CLK
  };
  ledc_timer_config(&timer);
  ledc_channel_config_t channel = {
    .gpio_num         = PIN_SERVO,
    .speed_mode       = LEDC_LOW_SPEED_MODE,
    .channel          = LEDC_CHANNEL_0,
    .intr_type        = LEDC_INTR_DISABLE,
    .timer_sel        = LEDC_TIMER_0,
    .duty             = 0,
    .hpoint           = 0
  };
  ledc_channel_config(&channel);
}
void setServoAngle(int angleDeg) {
  if (angleDeg < 0) angleDeg = 0;
  if (angleDeg > 90) angleDeg = 90;
  lastServoDeg = angleDeg;
  int pulseUs = 500 + (1500 * angleDeg / 90);
  uint32_t max_duty = (1 << 14) - 1;
  uint32_t duty = (pulseUs * max_duty) / 20000;
  ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, duty);
  ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
}
// Boot: NeoPixel, set1/set2 outputs, servo parked at 45 degrees.
void setupPins() {
  pinMode(RGB_LED_PIN, OUTPUT);
  digitalWrite(RGB_LED_PIN, LOW);
  pixels.begin();
  pixels.show();
  pinMode(PIN_SET1, OUTPUT);
  pinMode(PIN_SET2, OUTPUT);
  digitalWrite(PIN_SET1, LOW);
  digitalWrite(PIN_SET2, LOW);
  setupServo();
  setServoAngle(45);
}
// DS18B20 read for dashboard, !temp, and scheduled summaries.
bool readTemperature(float &tempC, float &tempF) {
  sensors.requestTemperatures();
  float c = sensors.getTempCByIndex(0);
  if (c == DEVICE_DISCONNECTED_C) {
    return false;
  }
  tempC = c;
  tempF = c * 9.0f / 5.0f + 32.0f;
  return true;
}
// ====== DISCORD REST ======
// HTTPS to discord.com: outbound chat, member fetch, channel lookup.

// Discord body for !sysinfo and the 4-hour auto post (heap includes 8MB PSRAM).
String getSystemInfo() {
  long rssi = WiFi.RSSI();
  uint32_t psramSize = ESP.getPsramSize();
  if (psramSize < BOARD_PSRAM_BYTES) psramSize = BOARD_PSRAM_BYTES;
  uint32_t psramFree = ESP.getFreePsram();
  if (ESP.getPsramSize() == 0) psramFree = BOARD_PSRAM_BYTES;
  uint32_t freeHeap = ESP.getFreeHeap() + psramFree;
  uint32_t totalHeap = ESP.getHeapSize() + psramSize;
  unsigned long uptimeSec = millis() / 1000;
  unsigned long days = uptimeSec / 86400;
  unsigned long hours = (uptimeSec % 86400) / 3600;
  unsigned long minutes = (uptimeSec % 3600) / 60;
  String uptimeStr = String(days) + "d " + String(hours) + "h " + String(minutes) + "m";
  return "📊 **System Diagnostics:**\n"
         "• **Uptime:** " + uptimeStr + "\n"
         "• **Free Heap:** " + String((unsigned long)freeHeap) + " / " +
         String((unsigned long)totalHeap) + " bytes\n"
         "• **WiFi RSSI:** " + String(rssi) + " dBm\n"
         "• **Gateway Status:** " + String((gatewayConnected && identified) ? "Connected" : "Disconnected") + "\n"
         "• **USB VBUS:** " + String((unsigned long)readUsbVbusMilliVolts()) + " mV\n"
         "• **Touch idle/trip:** " + String((unsigned long)touchIdleAvg) + " / " +
         String((unsigned long)touchTripPoint()) + "\n"
         "• **Firmware:** https://github.com/dogma2u/A-discord-bot-on-ESP32";
}
// Discord REST: POST a chat message to a channel (content max 2000 chars).
bool httpsInUse = false; // blocks re-entrant REST while DeepSeek (or other) holds httpsClient
bool sendDiscordMessage(const String& channelId, const String& content, bool suppressEmbeds = false) {
  if (httpsInUse) return false;
  String post = content;
  if (post.length() > 2000) post = post.substring(0, 1997) + "...";
  httpsInUse = true;
  httpsClient.stop();
  httpsClient.setInsecure();
  if (!httpsClient.connect("discord.com", 443)) {
    // Serial.println("[REST] HTTPS connect failed");
    httpsInUse = false;
    return false;
  }
  String url = "/api/v10/channels/" + channelId + "/messages";
  // 4096 fits Discord's 2000-char content plus JSON overhead.
  StaticJsonDocument<4096> doc;
  doc["content"] = post;
  doc["tts"] = false;
  if (suppressEmbeds) doc["flags"] = 4; // SUPPRESS_EMBEDS: link stays a URL, no GitHub card
  if (post.length() > 0 && doc["content"].isNull()) {
    httpsClient.stop();
    httpsInUse = false;
    return false;
  }

  String body;
  serializeJson(doc, body);
  String request =
    "POST " + url + " HTTP/1.1\r\n"
    "Host: discord.com\r\n"
    "Authorization: Bot " + String(BOT_TOKEN) + "\r\n"
    "Content-Type: application/json\r\n"
    "Content-Length: " + String(body.length()) + "\r\n"
    "Connection: close\r\n\r\n" +
    body;
  httpsClient.print(request);
  unsigned long start = millis();
  String statusLine;
  while (httpsClient.connected() && millis() - start < 5000) {
    if (httpsClient.available()) {
      String line = httpsClient.readStringUntil('\n');
      if (statusLine.length() == 0) statusLine = line;
      if (line == "\r" || line.length() == 0) break;
    }
  }
  httpsClient.stop();
  httpsInUse = false;
  statusLine.trim();
  int code = 0;
  int sp = statusLine.indexOf(' ');
  if (sp >= 0) code = statusLine.substring(sp + 1).toInt();
  return code >= 200 && code < 300;
}
// Gateway OP 3: set MiniMe's Discord Online / Idle status.
void sendBotPresence(const char* status, bool afk) {
  if (!gatewayConnected || !identified) return;
  StaticJsonDocument<256> doc;
  doc["op"] = 3;
  JsonObject d = doc.createNestedObject("d");
  d["since"] = nullptr;
  d.createNestedArray("activities");
  d["status"] = status;
  d["afk"] = afk;
  String payload;
  serializeJson(doc, payload);
  gatewayWS.sendTXT(payload);
}

// Mark activity: Online on Discord; restart the 5-minute idle timer.
void noteBotActivity() {
  lastBotActivityMillis = millis();
  if (!gatewayConnected || !identified) return;
  if (botDiscordStatus == 2 && botDiscordStatusSent) return;
  botDiscordStatus = 2;
  botDiscordStatusSent = true;
  sendBotPresence("online", false);
}

