dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
// Look up a channel's guild id via REST.
String guildIdFromChannel(const String& channelId) {
  if (!discordIdLooksValid(channelId)) return "";

  String body, status;
  if (!discordRestGet("/api/v10/channels/" + channelId, body, status)) {
    // Serial.print("[MEMBERS] channel lookup failed: ");
    // Serial.println(status);
    return "";
  }
  int jsonStart = body.indexOf('{');
  if (jsonStart < 0) {
    // Serial.print("[MEMBERS] channel lookup: no JSON. ");
    // Serial.println(status);
    return "";
  }
  if (jsonStart > 0) body = body.substring(jsonStart);

  StaticJsonDocument<64> filter;
  filter["guild_id"] = true;
  StaticJsonDocument<512> doc;
  DeserializationError err = deserializeJson(doc, body, DeserializationOption::Filter(filter));
  if (err) {
    // Serial.print("[MEMBERS] channel JSON error: ");
    // Serial.println(err.c_str());
    return "";
  }
  String gid = doc["guild_id"] | "";
  // Serial.print("[MEMBERS] guild from channel: ");
  // Serial.println(gid);
  return gid;
}

void rememberGuildId(const String& gid) {
  String id = gid;
  id.trim();
  if (!discordIdLooksValid(id)) return;
  for (uint8_t i = 0; i < cachedGuildCount; i++) {
    if (cachedGuildIds[i] == id) return;
  }
  if (cachedGuildCount >= 3) return;
  cachedGuildIds[cachedGuildCount++] = id;
}

// Append non-bot members from one guild into free OLED slots (skip users already loaded).
bool appendMembersFromGuild(const String& guildId, uint8_t maxToAdd) {
  if (!discordIdLooksValid(guildId)) return false;

  String body, status;
  String path = "/api/v10/guilds/" + guildId + "/members?limit=200";
  if (!discordRestGet(path, body, status)) {
    // Serial.print("[MEMBERS] fetch failed: ");
    // Serial.println(status);
    return false;
  }
  // Serial.print("[MEMBERS] HTTP ");
  // Serial.println(status);

  int jsonStart = body.indexOf('[');
  int objStart = body.indexOf('{');
  if (jsonStart < 0 || (objStart >= 0 && objStart < jsonStart)) {
    // Serial.print("[MEMBERS] not a member array: ");
    // Serial.println(body.substring(0, 180));
    return false;
  }
  if (jsonStart > 0) body = body.substring(jsonStart);

  StaticJsonDocument<256> filter;
  filter[0]["nick"] = true;
  filter[0]["user"]["id"] = true;
  filter[0]["user"]["username"] = true;
  filter[0]["user"]["global_name"] = true;
  filter[0]["user"]["bot"] = true;

  DynamicJsonDocument doc(8192);
  DeserializationError err = deserializeJson(doc, body, DeserializationOption::Filter(filter));
  if (err) {
    // Serial.print("[MEMBERS] JSON parse error: ");
    // Serial.println(err.c_str());
    return false;
  }

  JsonArray members = doc.as<JsonArray>();
  if (members.isNull()) {
    // Serial.println("[MEMBERS] no member array");
    return false;
  }

  uint8_t added = 0;
  for (JsonObject member : members) {
    if (added >= maxToAdd) break;
    uint8_t slot = 255;
    for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
      if (!trackedUsers[i].active) { slot = i; break; }
    }
    if (slot == 255) break;
    if (member["user"]["bot"] == true) continue;
    String uid = member["user"]["id"] | "";
    String name = member["nick"] | "";
    if (name.length() == 0) name = member["user"]["global_name"] | "";
    if (name.length() == 0) name = member["user"]["username"] | "";
    if (uid.length() == 0 || name.length() == 0) continue;
    if (findUserIndex(uid) >= 0) continue;
    trackedUsers[slot].active = true;
    trackedUsers[slot].userId = uid;
    trackedUsers[slot].userName = name;
    trackedUsers[slot].status = 0;
    trackedUsers[slot].useCount24h = 0;
    // Serial.print("[MEMBERS] ");
    // Serial.print(slot);
    // Serial.print(": ");
    // Serial.println(name);
    added++;
  }

  // Serial.print("[MEMBERS] added from guild: ");
  // Serial.println(added);
  return added > 0;
}

// Boot: load members from BOT_GUILD_ID and both command-channel guilds (two servers).
bool fetchGuildMembersAtStartup() {
  initTrackedUsers();
  cachedGuildCount = 0;
  rememberGuildId(String(BOT_GUILD_ID));
  rememberGuildId(guildIdFromChannel(TARGET_CHANNEL_ID));
  rememberGuildId(guildIdFromChannel(String(TARGET_CHANNEL_ID1)));

  if (cachedGuildCount == 0) {
    // Serial.println("[MEMBERS] no valid BOT_GUILD_ID or channel guilds");
    return false;
  }

  bool any = false;
  uint8_t share = (cachedGuildCount > 0) ? (MAX_TRACKED_USERS / cachedGuildCount) : MAX_TRACKED_USERS;
  if (share < 1) share = 1;
  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (appendMembersFromGuild(cachedGuildIds[g], share)) any = true;
  }
  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (appendMembersFromGuild(cachedGuildIds[g], MAX_TRACKED_USERS)) any = true;
  }
  uint8_t n = 0;
  for (uint8_t i = 0; i < MAX_TRACKED_USERS; i++) {
    if (trackedUsers[i].active) n++;
  }
  // Serial.print("[MEMBERS] loaded users: ");
  // Serial.println(n);
  return any;
}

// ====== SCIENCE / AI HTTP HELPERS ======
String collapseWhitespace(String s) {
  s.replace("\n", " ");
  s.replace("\r", " ");
  s.replace("\t", " ");
  while (s.indexOf("  ") >= 0) {
    s.replace("  ", " ");
  }
  s.trim();
  return s;
}
String truncateText(const String& s, int maxLen) {
  if (s.length() <= maxLen) return s;
  return s.substring(0, maxLen - 3) + "...";
}
// !news — Spaceflight News API, 3 headlines.
bool getScienceNews(String& outReport) {
  httpsClient.stop();
  httpsClient.setInsecure();
  if (!httpsClient.connect("api.spaceflightnewsapi.net", 443)) {
    outReport = "Science news connection failed.";
    return false;
  }
  httpsClient.print(
    "GET /v4/articles/?limit=3 HTTP/1.1\r\n"
    "Host: api.spaceflightnewsapi.net\r\n"
    "User-Agent: MiniMeBot/1.0\r\n"
    "Connection: close\r\n\r\n");
  if (!skipHttpHeaders(httpsClient, 8000)) {
    outReport = "Science news timeout.";
    httpsClient.stop();
    return false;
  }
  StaticJsonDocument<192> filter;
  filter["results"][0]["title"] = true;
  filter["results"][0]["news_site"] = true;
  filter["results"][0]["url"] = true;
  StaticJsonDocument<2048> doc;
  DeserializationError err = deserializeJson(doc, httpsClient, DeserializationOption::Filter(filter));
  httpsClient.stop();
  if (err) {
    outReport = "Science news JSON parse error.";
    return false;
  }
  JsonArray results = doc["results"].as<JsonArray>();
  if (results.isNull() || results.size() == 0) {
    outReport = "No science headlines right now.";
    return false;
  }
  outReport = "🛰️ **Space & high-tech headlines:**\n";
  int n = 0;
  for (JsonObject item : results) {
    if (n >= 3) break;
    String title = collapseWhitespace(item["title"] | "Untitled");
    String site = item["news_site"] | "Source";
    String url = item["url"] | "";
    outReport += String(n + 1) + ". **" + truncateText(title, 140) + "** (" + site + ")";
    if (url.length()) outReport += "\n" + url;
    outReport += "\n";
    n++;
  }
  return n > 0;
}
// !physics — arXiv cat:physics, 3 newest papers.
bool getPhysicsPapers(String& outReport) {
  httpsClient.stop();
  httpsClient.setInsecure();
  if (!httpsClient.connect("export.arxiv.org", 443)) {
    outReport = "arXiv connection failed.";
    return false;
  }
  httpsClient.print(
    "GET /api/query?search_query=cat:physics.*&start=0&max_results=3&sortBy=submittedDate&sortOrder=descending HTTP/1.1\r\n"
    "Host: export.arxiv.org\r\n"
    "User-Agent: MiniMeBot/1.0 (ESP32 Discord bot)\r\n"
    "Accept-Encoding: identity\r\n"
    "Connection: close\r\n\r\n");
  if (!skipHttpHeaders(httpsClient, 8000)) {
    outReport = "arXiv timeout.";
    httpsClient.stop();
    return false;
  }
  String xml;
  unsigned long start = millis();
  while (millis() - start < 8000) {
    while (httpsClient.available()) {
      xml += httpsClient.readString();
      if (xml.length() > 24000) break;
    }
    if (!httpsClient.connected() && !httpsClient.available()) break;
    delay(10);
  }
  httpsClient.stop();
  if (xml.length() < 50) {
    outReport = "arXiv response empty.";
    return false;
  }
  outReport = "⚛️ **Latest arXiv physics papers:**\n";
  int from = 0;
  int n = 0;
  while (n < 3) {
    int entry = xml.indexOf("<entry>", from);
    if (entry < 0) break;
    int entryEnd = xml.indexOf("</entry>", entry);
    if (entryEnd < 0) break;
    String block = xml.substring(entry, entryEnd);
    int t0 = block.indexOf("<title>");
    int t1 = block.indexOf("</title>");
    String title = "Untitled";
    if (t0 >= 0 && t1 > t0) {
      title = collapseWhitespace(block.substring(t0 + 7, t1));
    }
    int i0 = block.indexOf("<id>");
    int i1 = block.indexOf("</id>");
    String id = "";
    if (i0 >= 0 && i1 > i0) {
      id = collapseWhitespace(block.substring(i0 + 4, i1));
    }
    outReport += String(n + 1) + ". **" + truncateText(title, 140) + "**";
    if (id.length()) outReport += "\n" + id;
    outReport += "\n";
    n++;
    from = entryEnd + 8;
  }
  if (n == 0) {
    outReport = "No physics papers found.";
    return false;
  }
  return true;
}
// !apod — NASA Astronomy Picture of the Day.
bool getApod(String& outReport) {
  httpsClient.stop();
  httpsClient.setInsecure();
  if (!httpsClient.connect("api.nasa.gov", 443)) {
    outReport = "NASA APOD connection failed.";
    return false;
  }
  String path = String("/planetary/apod?api_key=") + NASA_API_KEY;
  httpsClient.print(String("GET ") + path + " HTTP/1.1\r\n" +
                    "Host: api.nasa.gov\r\n" +
                    "User-Agent: MiniMeBot/1.0\r\n" +
                    "Connection: close\r\n\r\n");
  if (!skipHttpHeaders(httpsClient, 8000)) {
    outReport = "NASA APOD timeout.";
    httpsClient.stop();
    return false;
  }
  StaticJsonDocument<128> filter;
  filter["title"] = true;
  filter["explanation"] = true;
  filter["date"] = true;
  filter["url"] = true;
  StaticJsonDocument<4096> doc;
  DeserializationError err = deserializeJson(doc, httpsClient, DeserializationOption::Filter(filter));
  httpsClient.stop();
  if (err) {
    outReport = "NASA APOD JSON parse error.";
    return false;
  }
  String title = doc["title"] | "Astronomy Picture of the Day";
  String date = doc["date"] | "";
  String expl = collapseWhitespace(doc["explanation"] | "");
  String url = doc["url"] | "";
  outReport = "🌌 **NASA APOD";
  if (date.length()) outReport += " (" + date + ")";
  outReport += ":**\n• **" + title + "**\n" + truncateText(expl, 350);
  if (url.length()) outReport += "\n" + url;
  return true;
}
// !iss — Open Notify ISS lat/lon.
bool getIssPosition(String& outReport) {
  WiFiClient client;
  if (!client.connect("api.open-notify.org", 80)) {
    outReport = "ISS tracker connection failed.";
    return false;
  }
  client.print(
    "GET /iss-now.json HTTP/1.1\r\n"
    "Host: api.open-notify.org\r\n"
    "Connection: close\r\n\r\n");
  if (!skipHttpHeaders(client, 5000)) {
    outReport = "ISS tracker timeout.";
    client.stop();
    return false;
  }
  StaticJsonDocument<512> doc;
  DeserializationError err = deserializeJson(doc, client);
  client.stop();
  if (err) {
    outReport = "ISS tracker JSON parse error.";
    return false;
  }
  String lat = doc["iss_position"]["latitude"] | "?";
  String lon = doc["iss_position"]["longitude"] | "?";
  outReport = "🌍 **ISS now:**\n"
              "• **Latitude:** " + lat + "\n"
              "• **Longitude:** " + lon;
  return true;
}
// !ask DeepSeek: queued from Gateway callback, HTTPS from loop().
bool askNeedPost = false;
String askPendingQuestion;
String askPendingChannelId;

// Shared HTTP body reader (chunked or Content-Length). Used by Discord REST and DeepSeek.
bool readHttpBodyAfterHeaders(Client& client, bool chunked, int contentLength,
                              String& outBody, unsigned long deadlineMs) {
  outBody = "";
  const size_t maxBody = 48000;
  if (chunked) {
    while (millis() < deadlineMs) {
      while (!client.available() && client.connected() && millis() < deadlineMs) {
        pumpGateway();
        delay(5);
      }
      if (!client.available()) break;
      String sizeLine = client.readStringUntil('\n');
      sizeLine.trim();
      if (sizeLine.length() == 0) continue;
      int sc = sizeLine.indexOf(';');
      if (sc >= 0) sizeLine = sizeLine.substring(0, sc);
      long chunkSize = strtol(sizeLine.c_str(), nullptr, 16);
      if (chunkSize <= 0) break;
      long got = 0;
      while (got < chunkSize && millis() < deadlineMs) {
        if (client.available()) {
          outBody += (char)client.read();
          got++;
          if (outBody.length() >= maxBody) return true;
        } else if (!client.connected()) {
          break;
        } else {
          pumpGateway();
          delay(1);
        }
      }
      client.readStringUntil('\n');
    }
    return outBody.length() > 0;
  }
  if (contentLength > 0) {
    while ((int)outBody.length() < contentLength && millis() < deadlineMs) {
      while (client.available()) {
        outBody += (char)client.read();
        if ((int)outBody.length() >= contentLength || outBody.length() >= maxBody) break;
      }
      if (!client.connected() && !client.available()) break;
      pumpGateway();
      delay(5);
    }
    return outBody.length() > 0;
  }
  while (millis() < deadlineMs) {
    while (client.available()) {
      outBody += (char)client.read();
      if (outBody.length() >= maxBody) return true;
    }
    if (!client.connected() && !client.available()) break;
    pumpGateway();
    delay(10);
  }
  return outBody.length() > 0;
}
// !ask — DeepSeek chat completion (max_tokens 900; Discord post capped at 2000 chars).
bool askDeepSeek(const String& question, String& outReport) {
  if (DEEPSEEK_API_KEY == nullptr || strlen(DEEPSEEK_API_KEY) == 0 ||
      strcmp(DEEPSEEK_API_KEY, "DEEPSEEK_API_KEY") == 0) {
    outReport = "DeepSeek API key not set. Add DEEPSEEK_API_KEY in the sketch.";
    return false;
  }
  String q = question;
  q.trim();
  if (q.length() == 0) {
    outReport = "Usage: !ask <question>";
    return false;
  }
  if (q.length() > 500) {
    q = q.substring(0, 500);
  }
  StaticJsonDocument<1536> req;
  req["model"] = "deepseek-chat";
  req["max_tokens"] = 900;
  req["temperature"] = 0.7;
  req["stream"] = false;
  JsonArray messages = req.createNestedArray("messages");
  JsonObject sys = messages.createNestedObject();
  sys["role"] = "system";
  sys["content"] = "You are MiniMe on an ESP32 Discord bot. Answer clearly for science, tech, and physics. Keep the full answer under 1800 characters so it fits one Discord message.";
  JsonObject user = messages.createNestedObject();
  user["role"] = "user";
  user["content"] = q;
  String body;
  serializeJson(req, body);
  // Serial.println("[ASK] TLS connect api.deepseek.com");
  httpsClient.stop();
  httpsClient.setInsecure();
  httpsClient.setTimeout(25000);
  if (!httpsClient.connect("api.deepseek.com", 443)) {
    outReport = "DeepSeek connection failed.";
    // Serial.println("[ASK] TLS connect failed");
    return false;
  }
  // Serial.println("[ASK] POST /chat/completions");
  String request =
    "POST /chat/completions HTTP/1.1\r\n"
    "Host: api.deepseek.com\r\n"
    "Authorization: Bearer " + String(DEEPSEEK_API_KEY) + "\r\n"
    "Content-Type: application/json\r\n"
    "Accept: application/json\r\n"
    "Accept-Encoding: identity\r\n"
    "User-Agent: MiniMeBot/1.0\r\n"
    "Content-Length: " + String(body.length()) + "\r\n"
    "Connection: close\r\n\r\n" +
    body;
  httpsClient.print(request);
  unsigned long deadline = millis() + 45000UL;
  while (httpsClient.available() == 0) {
    pumpGateway();
    if (millis() > deadline) {
      outReport = "DeepSeek timeout waiting for headers.";
      httpsClient.stop();
      return false;
    }
    delay(10);
  }
  String statusLine = httpsClient.readStringUntil('\n');
  statusLine.trim();
  bool chunked = false;
  int contentLength = -1;
  while (millis() <= deadline) {
    String line = httpsClient.readStringUntil('\n');
    if (line == "\r" || line.length() == 0) break;
    String lower = line;
    lower.toLowerCase();
    if (lower.startsWith("transfer-encoding:") && lower.indexOf("chunked") >= 0) {
      chunked = true;
    }
    if (lower.startsWith("content-length:")) {
      contentLength = lower.substring(lower.indexOf(':') + 1).toInt();
    }
  }
  String respBody;
  if (!readHttpBodyAfterHeaders(httpsClient, chunked, contentLength, respBody, deadline)) {
    httpsClient.stop();
    outReport = "DeepSeek empty response. " + statusLine;
    return false;
  }
  httpsClient.stop();
  int jsonStart = respBody.indexOf('{');
  if (jsonStart < 0) {
    outReport = "DeepSeek: no JSON body. " + truncateText(statusLine, 80);
    return false;
  }
  if (jsonStart > 0) {
    respBody = respBody.substring(jsonStart);
  }
  StaticJsonDocument<128> filter;
  filter["choices"][0]["message"]["content"] = true;
  filter["error"]["message"] = true;
  StaticJsonDocument<12288> doc;
  DeserializationError err = deserializeJson(doc, respBody, DeserializationOption::Filter(filter));
  if (err) {
    outReport = "DeepSeek JSON parse error (" + String(err.c_str()) + ").";
    return false;
  }
  if (doc.containsKey("error")) {
    String emsg = doc["error"]["message"] | "API error";
    outReport = "DeepSeek error: " + truncateText(emsg, 200);
    return false;
  }
  String answer = collapseWhitespace(doc["choices"][0]["message"]["content"] | "");
  if (answer.length() == 0) {
    int ckey = respBody.indexOf("\"content\"");
    if (ckey >= 0) {
      int colon = respBody.indexOf(':', ckey);
      int q1 = respBody.indexOf('"', colon + 1);
      if (q1 >= 0) {
        String extracted;
        for (int i = q1 + 1; i < (int)respBody.length(); i++) {
          char c = respBody[i];
          if (c == '\\' && i + 1 < (int)respBody.length()) {
            char n = respBody[i + 1];
            if (n == 'n') { extracted += ' '; i++; continue; }
            if (n == '"' || n == '\\') { extracted += n; i++; continue; }
          }
          if (c == '"') break;
          extracted += c;
          if (extracted.length() > 1900) break;
        }
        answer = collapseWhitespace(extracted);
      }
    }
  }
  if (answer.length() == 0) {
    outReport = "DeepSeek returned an empty answer. " + truncateText(statusLine, 60);
    return false;
  }
  const char* prefix = "🧠 **DeepSeek:**\n";
  int room = 2000 - (int)strlen(prefix);
  if (room < 100) room = 100;
  outReport = String(prefix) + truncateText(answer, room);
  return true;
}
void runAskFromLoop() {
  if (!askNeedPost) return;
  askNeedPost = false;
  String channelId = askPendingChannelId;
  String report;
  httpsInUse = true; // keep Gateway from starting other HTTPS during DeepSeek
  bool ok = askDeepSeek(askPendingQuestion, report);
  httpsInUse = false;
  askPendingQuestion = "";
  askPendingChannelId = "";
  if (!sendDiscordMessage(channelId, report)) {
    // Short fallback so the user always sees something if the long post was rejected.
    String fallback = ok
      ? "DeepSeek answered, but Discord rejected the post (try a shorter question)."
      : truncateText(report, 1800);
    if (!sendDiscordMessage(channelId, fallback)) {
      dashLastEvent = "Ask post fail";
      showTransient("DeepSeek", "Post fail");
      return;
    }
  }
  if (ok) {
    dashLastEvent = "Ask sent";
    showTransient("DeepSeek", "Sent");
  } else {
    dashLastEvent = "Ask error";
    showTransient("DeepSeek", "Error");
  }
}
// ====== DISCORD COMMAND DISPATCH ======
// Public commands first; anything else requires OWNER_ID_STR.
void handleCommand(const String& content, const String& authorId, const String& authorName,
                   const String& channelId, bool isDM)
{
  // Reply only in DMs, TARGET_CHANNEL_ID, or TARGET_CHANNEL_ID1
  if (!isDM && channelId != TARGET_CHANNEL_ID && channelId != TARGET_CHANNEL_ID1) {
    return;
  }
  String raw = content;
  raw.trim();
  bool midLine = false;
  if (!raw.startsWith("!")) {
    int bang = -1;
    for (int i = 0; i < raw.length(); i++) {
      if (raw.charAt(i) != '!') continue;
      char next = (i + 1 < raw.length()) ? raw.charAt(i + 1) : 0;
      if (!((next >= 'a' && next <= 'z') || (next >= 'A' && next <= 'Z'))) continue;
      if (i > 0) {
        char prev = raw.charAt(i - 1);
        if (prev != ' ' && prev != '\t' && prev != '\n') continue;
      }
      bang = i;
      break;
    }
    if (bang < 0) return; // normal chat — ignore
    raw = raw.substring(bang);
    midLine = true;
  }

  noteBotActivity();
  int spIdx = raw.indexOf(' ');
  String cmdWord = (spIdx > 0) ? raw.substring(0, spIdx) : raw;
  String args = (spIdx > 0) ? raw.substring(spIdx + 1) : "";
  cmdWord.toLowerCase(); // command only — leave args as typed
  args.trim();
  // Mid-sentence: keep only the next word for one-word args (!led on, !weather zip, …).
  // !ask / !display still use the rest of the line as the payload.
  if (midLine && args.length() > 0 &&
      cmdWord != "!ask" && cmdWord != "!display") {
    int argSp = args.indexOf(' ');
    if (argSp > 0) args = args.substring(0, argSp);
    while (args.length() > 0) {
      char last = args.charAt(args.length() - 1);
      if (last == '.' || last == ',' || last == '!' || last == '?' || last == ';' || last == ':') {
        args.remove(args.length() - 1);
      } else {
        break;
      }
    }
  }

  // Extract command name for the dashboard (first word, max 14 chars)
  dashLastCmd = cmdWord;
  if (dashLastCmd.length() > 14) dashLastCmd = dashLastCmd.substring(0, 14);
  dashLastCmdMillis = millis();

  // Count this command usage for dashboard (reset happens every 24h).
  recordUserUse(authorId, authorName);

