dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
  if (cmdWord == "!help") {
    String helpMsg =
      "🤖 **MiniMe Bot Commands**\n\n"
      "**👤 Public Commands:**\n"
      "• `!apod` — NASA Astronomy Picture of the Day.\n"
      "• `!ask <question>` — Asks DeepSeek (text AI reply in chat).\n"
      "• `!display <text>` — Writes custom text to the OLED screen.\n"
      "• `!help` — Shows this command list.\n"
      "• `!iss` — Current International Space Station position.\n"
      "• `!news` — Space and high-tech science headlines.\n"
      "• `!physics` — Latest arXiv physics papers.\n"
      "• `!sysinfo` — Displays system diagnostics (uptime, heap, RSSI, etc.).\n"
      "• `!temp` — Reads the current indoor temperature sensor.\n"
      "• `!time` — Displays the current bot time.\n"
      "• `!weather <zip>` — Fetches the weather report for a US ZIP code.\n\n"
      "**👑 Owner-Only Commands:**\n"
      "• `!led on` / `!led off` — Controls the RGB NeoPixel LED.\n"
      "• `!servo <0-90>` — Moves the servo motor to a specific angle.\n"
      "• `!set1 on` / `!set1 off` — Controls digital output pin 1.\n"
      "• `!set2 on` / `!set2 off` — Controls digital output pin 2.";
    sendDiscordMessage(channelId, helpMsg);
    dashLastEvent = "Help sent";
    showTransient("Help", "Command Sent");
    return;
  }
  if (cmdWord == "!weather") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !weather <zip>");
      return;
    }
    String zip = args;
    bool validZip = (zip.length() == 5);
    if (validZip) {
      for (unsigned i = 0; i < 5; i++) {
        char c = zip.charAt(i);
        if (c < '0' || c > '9') { validZip = false; break; }
      }
    }
    if (!validZip) {
      sendDiscordMessage(channelId, "Invalid ZIP code.");
      return;
    }
    String report;
    showTransient("Weather", "Fetching " + zip + "...");
    if (getWeather(zip, report)) {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "Weather " + zip;
      showTransient("Weather", zip, "Sent");
    } else {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "Weather error";
      showTransient("Weather", "Error");
    }
    return;
  }
  if (cmdWord == "!news") {
    String report;
    showTransient("News", "Fetching...");
    if (getScienceNews(report)) {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "News sent";
      showTransient("News", "Sent");
    } else {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "News error";
      showTransient("News", "Error");
    }
    return;
  }
  if (cmdWord == "!physics") {
    String report;
    showTransient("Physics", "Fetching arXiv...");
    if (getPhysicsPapers(report)) {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "Physics sent";
      showTransient("Physics", "Sent");
    } else {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "Physics error";
      showTransient("Physics", "Error");
    }
    return;
  }
  if (cmdWord == "!apod") {
    String report;
    showTransient("APOD", "Fetching NASA...");
    if (getApod(report)) {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "APOD sent";
      showTransient("APOD", "Sent");
    } else {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "APOD error";
      showTransient("APOD", "Error");
    }
    return;
  }
  if (cmdWord == "!iss") {
    String report;
    showTransient("ISS", "Fetching...");
    if (getIssPosition(report)) {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "ISS sent";
      showTransient("ISS", "Sent");
    } else {
      sendDiscordMessage(channelId, report);
      dashLastEvent = "ISS error";
      showTransient("ISS", "Error");
    }
    return;
  }
  if (cmdWord == "!temp") {
    float c, f;
    if (readTemperature(c, f)) {
      dashTempC = c;
      dashTempF = f;
      String msg = "Current Temp: " + String(c, 1) + "°C / " + String(f, 1) + "°F";
      sendDiscordMessage(channelId, msg);
      dashLastEvent = String(f, 1) + "F sent";
      showTransient("Temp", String(f, 1) + "F/" + String(c, 1) + "C");
    } else {
      sendDiscordMessage(channelId, "Temperature sensor error.");
      dashLastEvent = "Temp sensor err";
      showTransient("Temp", "Sensor error");
    }
    return;
  }
  if (cmdWord == "!sysinfo") {
    sendDiscordMessage(channelId, getSystemInfo(), true);
    dashLastEvent = "SysInfo sent";
    showTransient("SysInfo", "Sent");
    return;
  }
  if (cmdWord == "!time") {
    updateLocalTime();
    String currentTime = timeClient.getFormattedTime();
    String msg = "🕒 Current Bot Time: " + currentTime;
    sendDiscordMessage(channelId, msg);
    dashLastEvent = "Time: " + currentTime;
    showTransient("Time", currentTime);
    return;
  }
  if (cmdWord == "!ask") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !ask <question>");
      return;
    }
    if (askNeedPost) {
      sendDiscordMessage(channelId, "DeepSeek is already answering. Try again in a moment.");
      return;
    }
    String question = args;
    askPendingQuestion = question;
    askPendingChannelId = channelId;
    askNeedPost = true;
    dashLastEvent = "Ask queued";
    showTransient("DeepSeek", "Queued");
    // Serial.println("[ASK] queued (HTTPS from loop)");
    return;
  }
  if (cmdWord == "!display") {
    if (args.length() == 0) {
      sendDiscordMessage(channelId, "Usage: !display <text>");
      return;
    }
    String text = args;
    if (text.length() > 50) text = text.substring(0, 50);
    String line15 = text.substring(0, text.length() > 25 ? 25 : text.length());
    String line16 = text.length() > 25 ? text.substring(25) : "";
    dashLastEvent = text.length() > 14 ? text.substring(0, 14) : text;
    showTransient(line15, line16, "", 6000);
    sendDiscordMessage(channelId, "Display updated.");
    return;
  }
  // Owner-only hardware: LED, set1/set2, servo.
  if (cmdWord == "!led" || cmdWord == "!set1" || cmdWord == "!set2" || cmdWord == "!servo") {
    if (!isOwner(authorId)) {
      if (!isDM) {
        sendDiscordMessage(channelId, "You are not allowed to use this command.");
      }
      return;
    }
    if (cmdWord == "!led") {
      String a = args;
      a.toLowerCase();
      if (a == "on") {
        pixels.setPixelColor(0, pixels.Color(255, 255, 255));
        pixels.show();
        sendDiscordMessage(channelId, "LED ON");
        dashLastEvent = "LED ON";
        showTransient("LED", "ON");
      } else if (a == "off") {
        pixels.setPixelColor(0, pixels.Color(0, 0, 0));
        pixels.show();
        sendDiscordMessage(channelId, "LED OFF");
        dashLastEvent = "LED OFF";
        showTransient("LED", "OFF");
      } else {
        sendDiscordMessage(channelId, "Usage: !led on/off");
      }
      return;
    }
    if (cmdWord == "!set1") {
      String a = args;
      a.toLowerCase();
      if (a == "on") {
        digitalWrite(PIN_SET1, HIGH);
        sendDiscordMessage(channelId, "set1 ON");
        dashLastEvent = "set1 ON";
        showTransient("set1", "ON");
      } else if (a == "off") {
        digitalWrite(PIN_SET1, LOW);
        sendDiscordMessage(channelId, "set1 OFF");
        dashLastEvent = "set1 OFF";
        showTransient("set1", "OFF");
      } else {
        sendDiscordMessage(channelId, "Usage: !set1 on/off");
      }
      return;
    }
    if (cmdWord == "!set2") {
      String a = args;
      a.toLowerCase();
      if (a == "on") {
        digitalWrite(PIN_SET2, HIGH);
        sendDiscordMessage(channelId, "set2 ON");
        dashLastEvent = "set2 ON";
        showTransient("set2", "ON");
      } else if (a == "off") {
        digitalWrite(PIN_SET2, LOW);
        sendDiscordMessage(channelId, "set2 OFF");
        dashLastEvent = "set2 OFF";
        showTransient("set2", "OFF");
      } else {
        sendDiscordMessage(channelId, "Usage: !set2 on/off");
      }
      return;
    }
    if (cmdWord == "!servo") {
      if (args.length() == 0) {
        sendDiscordMessage(channelId, "Usage: !servo <0-90>");
        return;
      }
      int angle = args.toInt();
      if (angle < 0 || angle > 90) {
        sendDiscordMessage(channelId, "Angle out of range. Allowed: 0-90 degrees.");
        return;
      }
      setServoAngle(angle);
      String msg = "Servo set to " + String(angle) + " degrees.";
      sendDiscordMessage(channelId, msg);
      dashLastEvent = "Servo " + String(angle) + "deg";
      showTransient("Servo", String(angle) + " deg");
      return;
    }
  }

  sendDiscordMessage(channelId, "That is not a command.");
  dashLastEvent = "Unknown cmd";
  showTransient("Unknown", cmdWord);
}
// ====== DISCORD GATEWAY WEBSOCKET ======
// HELLO -> IDENTIFY; READY / GUILD_* / PRESENCE_UPDATE for OLED; MESSAGE_CREATE -> handleCommand.
void gatewayEvent(WStype_t type, uint8_t * payload, size_t length) {
  switch (type) {
    case WStype_DISCONNECTED:
      gatewayConnected = false;
      identified       = false;
      botDiscordStatusSent = false;
      // Serial.println("[GW] DISCONNECTED");
      dashLastEvent = "GW Disconnected";
      showTransient("Gateway", "Disconnected");
      break;
    case WStype_CONNECTED:
      gatewayConnected = true;
      // Serial.println("[GW] CONNECTED");
      dashLastEvent = "GW Connected";
      showTransient("Gateway", "Connected");
      break;
    case WStype_TEXT: {
      static StaticJsonDocument<384> gwFilter;
      static bool gwFilterInit = false;
      if (!gwFilterInit) {
        gwFilter["op"] = true;
        gwFilter["s"] = true;
        gwFilter["t"] = true;
        gwFilter["d"]["heartbeat_interval"] = true;
        gwFilter["d"]["status"] = true;
        gwFilter["d"]["user"]["id"] = true;
        gwFilter["d"]["user"]["username"] = true;
        gwFilter["d"]["user"]["global_name"] = true;
        gwFilter["d"]["content"] = true;
        gwFilter["d"]["channel_id"] = true;
        gwFilter["d"]["guild_id"] = true;
        gwFilter["d"]["author"]["id"] = true;
        gwFilter["d"]["author"]["username"] = true;
        gwFilter["d"]["author"]["global_name"] = true;
        gwFilter["d"]["author"]["bot"] = true;
        gwFilter["d"]["presences"][0]["user"]["id"] = true;
        gwFilter["d"]["presences"][0]["status"] = true;
        gwFilter["d"]["guilds"][0]["presences"][0]["user"]["id"] = true;
        gwFilter["d"]["guilds"][0]["presences"][0]["status"] = true;
        gwFilterInit = true;
      }

      if (!gwDoc) return;
      gwDoc->clear();
      DeserializationError err = deserializeJson(*gwDoc, payload, length, DeserializationOption::Filter(gwFilter));
      if (err) return;
      int op = (*gwDoc)["op"] | -1;
      if (gwDoc->containsKey("s") && !(*gwDoc)["s"].isNull()) {
        lastSeq = (*gwDoc)["s"].as<int>();
      }
      if (op == 10) {
        heartbeatIntervalMs = (*gwDoc)["d"]["heartbeat_interval"] | 0;
        lastHeartbeatMillis = millis();
        sendIdentify();
        identified = true;
        return;
      }
      if (op == 11) return;
      if (op == 0) {
        const char* t = (*gwDoc)["t"];
        if (!t) return;
        if (strcmp(t, "READY") == 0) {
          JsonArray guilds = (*gwDoc)["d"]["guilds"].as<JsonArray>();
          if (!guilds.isNull()) {
            for (JsonObject g : guilds) {
              applyPresencesArray(g["presences"].as<JsonArray>());
            }
          }
          requestTrackedUserPresences();
          return;
        }
        if (strcmp(t, "GUILD_CREATE") == 0) {
          applyPresencesArray((*gwDoc)["d"]["presences"].as<JsonArray>());
          requestTrackedUserPresences();
          return;
        }
        if (strcmp(t, "GUILD_MEMBERS_CHUNK") == 0) {
          applyPresencesArray((*gwDoc)["d"]["presences"].as<JsonArray>());
          return;
        }
        if (strcmp(t, "PRESENCE_UPDATE") == 0) {
          handlePresenceUpdate((*gwDoc)["d"]);
          return;
        }
        if (strcmp(t, "MESSAGE_CREATE") == 0) {
          if (httpsInUse) return; // DeepSeek holds HTTPS; defer commands until free
          JsonObject d = (*gwDoc)["d"];
          if (d["author"]["bot"] == true) return;
          String content   = d["content"].as<String>();
          String channelId = d["channel_id"].as<String>();
          String authorId  = d["author"]["id"].as<String>();
          String authorName = d["author"]["global_name"].as<String>();
          if (authorName.length() == 0) {
            authorName = d["author"]["username"].as<String>();
          }
          bool isDM = d["guild_id"].isNull();
          handleCommand(content, authorId, authorName, channelId, isDM);
        }
      }
      break;
    }
    default:
      break;
  }
}
// ====== SCHEDULED POSTS (loop) ======
// Auto Discord posts: 4-hour sysinfo; 06:00 / 12:00 / 18:00 Pacific indoor temp.
void backgroundTasks() {
  runAskFromLoop();
  unsigned long now = millis();
  // Every 4 hours: System Health Report (wait for Gateway so boot post is not "Disconnected")
  if (gatewayConnected && identified &&
      (lastSysInfoMillis == 0 || now - lastSysInfoMillis >= SYSINFO_INTERVAL_MS)) {
    lastSysInfoMillis = now;
    noteBotActivity();
    sendDiscordMessage(TARGET_CHANNEL_ID, getSystemInfo(), true);
  }
  // Scheduled Daily Summaries (6 AM, 12 PM, 6 PM)
  updateLocalTime();
  int currentHour = timeClient.getHours();
  int currentMinute = timeClient.getMinutes();
  if ((currentHour == 6 || currentHour == 12 || currentHour == 18) && currentMinute == 0) {
    if (lastSentHour != currentHour) {
      lastSentHour = currentHour;
      float c, f;
      noteBotActivity();
      if (readTemperature(c, f)) {
        String report = "⏰ **Scheduled Summary (" + String(currentHour) + ":00):**\n" +
                        "• **Indoor Temp:** " + String(c, 1) + "°C / " + String(f, 1) + "°F";
        sendDiscordMessage(TARGET_CHANNEL_ID, report);
        dashLastEvent = "Sched report";
        showTransient("Scheduled", "Report Sent");
      } else {
        sendDiscordMessage(TARGET_CHANNEL_ID, "⏰ **Scheduled Summary:** Temperature sensor error.");
      }
    }
  } else {
    if (lastSentHour != -1 && currentHour != 6 && currentHour != 12 && currentHour != 18) {
      lastSentHour = -1;
    }
  }
}
// ====== SETUP / LOOP ======
// Boot order: serial, PSRAM, OLED, pins, Wi-Fi, NTP, members, Gateway, touch, dashboard.

// Station Wi-Fi. Blocks until connected (OLED shows Connecting / Connected).
void connectWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  drawStatus("WiFi", "Connecting...");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
  }
  drawStatus("WiFi", "Connected");
}
// Discord Gateway websocket (JSON encoding, auto-reconnect 5s).
void connectGateway() {
  gatewayWS.beginSSL("gateway.discord.gg", 443, "/?v=10&encoding=json");
  gatewayWS.onEvent(gatewayEvent);
  gatewayWS.setReconnectInterval(5000);
}
// Boot: serial, PSRAM JSON, OLED, pins, Wi-Fi, NTP, member list, then Gateway.
void setup() {
  // Serial.begin(115200); // testing only
  delay(500);
  // Serial.print("PSRAM size: ");
  // Serial.println(ESP.getPsramSize());
  gwDoc = new DynamicJsonDocument(GW_DOC_PSRAM);
  // Serial.print("GW JSON cap: ");
  // Serial.println(gwDoc->capacity());
  initTrackedUsers();
  Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
  u8g2.begin();
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
  lastDisplayActivityMillis = millis();
  drawStatus("Booting...", "ESP32-S3 Discord bot");
  setupPins();
  sensors.begin();
  connectWiFi();
  timeClient.begin();
  drawStatus("Discord", "Loading users...");
  if (fetchGuildMembersAtStartup()) {
    String n0 = trackedUsers[0].userName.length() ? trackedUsers[0].userName : "ok";
    drawStatus("Users loaded", n0);
  } else {
    drawStatus("Users", "Fetch failed");
  }
  delay(1200);
  connectGateway();
  setServoAngle(45);
  lastDashMillis = 0;
  setupTouch(); // once, after WiFi/I2C — do not recalibrate earlier
  drawStatus("Ready", "Idle presence");
  drawDashboard();
}
// Gateway pump, heartbeat, scheduled posts, OLED refresh/sleep. MCU never sleeps here.
void loop() {
  pumpGateway();
  applyCpuForIdleState();
  backgroundTasks();
  // debugTouchSerial();
  pollTouchWake();
  updateBotPresenceIdle();
  updateDisplay();
  applyCpuForIdleState();
  delay(5);
}
